# Функція, яка обчислює значення похідної y' = x^3 + y^2
def f(x, y):
    return x**3 + y**2

# Задаємо початкові значення
x0 = 0
y0 = 0.5
h = 0.1
xf = 0.5

# Використовуємо метод Ейлера з використанням середньої точки для розв'язання диференціального рівняння
while x0 < xf:
    # Розрахунок значення y в точці x+h/2
    y_half = y0 + (h / 2) * f(x0, y0)
    # Розрахунок нового значення y
    y1 = y0 + h * f(x0 + h / 2, y_half)
    # Оновлення значення x та y для наступного кроку
    x0 = x0 + h
    y0 = y1

# Виводимо значення функції у(0.5)
print("Значення функції у(0.5) =", y0)