import numpy as np

# Визначаємо праву частину диференціального рівняння
def f(x, y, a):
    return np.cos(y)/(a+x) + y**2

# Визначаємо функцію для методу Рунге-Кутта четвертого порядку
def RK4(f, x0, y0, h, a):
    k1 = h * f(x0, y0, a)    # Обчислюємо перший коефіцієнт
    k2 = h * f(x0 + h/2, y0 + k1/2, a)    # Обчислюємо другий коефіцієнт
    k3 = h * f(x0 + h/2, y0 + k2/2, a)    # Обчислюємо третій коефіцієнт
    k4 = h * f(x0 + h, y0 + k3, a)    # Обчислюємо четвертий коефіцієнт
    return y0 + (1/6)*(k1 + 2*k2 + 2*k3 + k4)    # Повертаємо значення функції в точці x0+h

# Початкові умови
x0 = 0
y0 = 0

# Значення, які потрібно знайти
x_values = [0.1, 0.2, 0.3]
y_values = []

# Розв'язок рівняння для кожного значення параметра a і кожної точки x
for k in range(6):    # Перебираємо значення параметра a
    a = 1 + 0.4*k    # Визначаємо значення параметра a
    for x in x_values:    # Перебираємо значення x, для яких потрібно знайти розв'язок
        y = RK4(f, x0, y0, x-x0, a)    # Обчислюємо значення функції в точці x
        y_values.append(y)    # Додаємо значення функції до списку розв'язків
        print(f'y({x}) при a={a} = {y}')    # Виводимо на екран значення функції для заданих x і a